## Hello guys! Welcome to Day-4 of the sessions. Hope you were able to complete the Day-3 task and didn't face any issues. In case you do, please make sure to put them up on the issues tab.

## Lets begin with this session right away!

So today we will seeing what pandas is.

In [1]:
import pandas as pd
import numpy as np
from numpy import nan as NA
from pandas import DataFrame, Series

## Introduction to pandas Data Structures

### Series
A Series is a one-dimensional array-like object containing an array of data (of any NumPy data type) and an associated array of data labels, called its index

In [2]:
## creating series by passing list
ls = [1, 2, 3, 4]
sr = Series(ls)
print(sr)

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
print(sr.values)
sr.index

[1 2 3 4]

RangeIndex(start=0, stop=4, step=1)

In [4]:
sr2 = Series(ls, index= list('abcd'))
print(sr2)

a    1
b    2
c    3
d    4
dtype: int64

In [5]:
## creating series by passing dict
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
sr3 = Series(sdata)
print(sr3)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [6]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
sr4 = Series(sdata, index= states)
print(sr4)

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

***Note: NaN (not a number) is considered in pandas to mark missing or NA values***

In [7]:
print(sr4.isnull())
sr4.notnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [8]:
print(sr2['a']) ## accessing value Corresponding to particular index
sr2[['a', 'c']]

1

a    1
c    3
dtype: int64

In [9]:
## NumPy array operations, such as filtering with a boolean array, scalar multiplication, or applying math functions, will preserve the index-value link
print(sr2[sr2 > 2])
sr2*3

c    3
d    4
dtype: int64

a     3
b     6
c     9
d    12
dtype: int64

In [10]:
## Another way to think about a Series is as a fixed-length, ordered dict, as it is a mapping of index values to data values. It can be substituted into many functions that expect a dict:
print('b' in sr2)

## A Series’s index can be altered in place by assignment
sr.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
sr

True

Bob      1
Steve    2
Jeff     3
Ryan     4
dtype: int64

### DataFrame
A DataFrame represents a tabular, spreadsheet-like data structure containing an ordered collection of columns, each of which can be a different value type (numeric, string, boolean, etc.). The DataFrame has both a row and column index; it can be thought of as a dict of Series (one for all sharing the same index)

In [11]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)
print(frame)

cols =['year', 'state', 'pop', 'debt']
ind = ['one', 'two', 'three', 'four', 'five']
frame2 = DataFrame(data, columns= cols, index= ind)
frame2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [12]:
print(frame2.isnull())
frame2.notnull()

        year  state    pop  debt
one    False  False  False  True
two    False  False  False  True
three  False  False  False  True
four   False  False  False  True
five   False  False  False  True

       year  state   pop   debt
one    True   True  True  False
two    True   True  True  False
three  True   True  True  False
four   True   True  True  False
five   True   True  True  False

In [13]:
## accessing column
print(frame2['state'])
# or
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [14]:
print(frame2[['state', 'debt']])
frame2.debt = np.arange(5)
frame2

        state debt
one      Ohio  NaN
two      Ohio  NaN
three    Ohio  NaN
four   Nevada  NaN
five   Nevada  NaN

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [15]:
## accessing rows and column together
print(frame2.iloc[2, 3])
## or
frame2.loc['two', 'pop']

2

1.7

In [16]:
frame2.index.name = 'year'
frame2.columns.name = 'random'
print(frame2)

## Datafrane ----> NumPy array
frame2.values

random  year   state  pop  debt
year
one     2000    Ohio  1.5     0
two     2001    Ohio  1.7     1
three   2002    Ohio  3.6     2
four    2001  Nevada  2.4     3
five    2002  Nevada  2.9     4

array([[2000, 'Ohio', 1.5, 0],
       [2001, 'Ohio', 1.7, 1],
       [2002, 'Ohio', 3.6, 2],
       [2001, 'Nevada', 2.4, 3],
       [2002, 'Nevada', 2.9, 4]], dtype=object)

![](Images/pd1.png)
Note: Index objects are immutable and thus can’t be modified by the user

In [17]:
ind = frame2.index
print(type(ind))
ind[1] = '2'

<class 'pandas.core.indexes.base.Index'>

TypeError: Index does not support mutable operations

### Reindexing

In [18]:
sr = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
print(sr.reindex(list('abcd')))
sr.reindex(list('abcde'), fill_value= 0)

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

![](Images/pd3.png)

`Table 5-4` lists available method options. At this time, interpolation more sophisticated than forward- and backfilling would need to be applied after the fact.
![](Images/pd2.png)

In [19]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

### Dropping entries from an axis

In [20]:
cols =['year', 'state', 'pop', 'debt']
ind = ['one', 'two', 'three', 'four', 'five']
frame2 = DataFrame(data, columns= cols, index= ind)

frame2.drop('five', inplace= True)
frame2.drop('debt', axis= 1, inplace= True)
frame2

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4

### Indexing, selection, and filtering
![](Images/pd4.png)

In [21]:
#selecting rows by slicing or a boolean array
frame2[frame2['year'] >= 2001]

       year   state  pop
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4

### Function application and mapping

In [22]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
f = lambda x: x.max() - x.min()
print(frame.apply(f))
frame.apply(f, axis= 1)

b    2.368545
d    1.545643
e    4.735058
dtype: float64

Utah      1.820862
Ohio      4.107120
Texas     0.353424
Oregon    1.203449
dtype: float64

### Sorting and ranking

In [23]:
## Sorting
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
print(obj.sort_index())

frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'], columns=['d', 'a', 'b', 'c'])
frame.sort_index(axis=1, ascending= False)

a    1
b    2
c    3
d    0
dtype: int64

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [24]:
## Ranking
# It is similar to the indirect sort indices produced by numpy.argsort
obj = Series([7, -5, 7, 4, 2, 0, 4])
print(obj.rank(method= 'average'))

frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1], 'c': [-2, 5, 8, -2.5]})
frame.rank(axis=1)

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

![](Images/pd5.png)

## Summarizing and Computing Descriptive Statistics

In [25]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
                index=['a', 'b', 'c', 'd'], columns=['one', 'two'])
print(df.sum())
df.sum(axis= 1)

one    9.25
two   -5.80
dtype: float64

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [26]:
print(df.mean(axis= 1, skipna= False))
df.idxmax()

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

one    b
two    d
dtype: object

In [27]:
## or
# describe is one such example, producing multiple summary statistics in one shot
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

![](Images/pd6.png)
## Correlation and Covariance
The corr method of Series computes the correlation of the overlapping, non-NA, aligned-by-index values in two Series. Relatedly, cov computes the covariance

In [28]:
dictn= {'google': [1,2,3,4], 'apple':[2,4,6,7], 'amazon': [4,6,2,9]}
df= DataFrame(dictn)
print(df.cov())
df.corr()

          google     apple    amazon
google  1.666667  2.833333  1.833333
apple   2.833333  4.916667  2.416667
amazon  1.833333  2.416667  8.916667

          google     apple    amazon
google  1.000000  0.989778  0.475571
apple   0.989778  1.000000  0.364989
amazon  0.475571  0.364989  1.000000

In [29]:
print(df['google'].corr(df['apple']))

## Using DataFrame’s corrwith method, you can compute pairwise correlations between a DataFrame’s columns or rows with another Series or DataFrame.
df.corrwith(df['amazon'])

0.9897782665572893

google    0.475571
apple     0.364989
amazon    1.000000
dtype: float64

## Unique Values, Value Counts, and Membership
![](Images/pd7.png)

In [30]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
print(obj.unique())
obj.value_counts()

['c' 'a' 'd' 'b']

a    3
c    3
b    2
d    1
dtype: int64

## Handling Missing Data
pandas uses the floating point value NaN (Not a Number) to represent missing data in both floating as well as in non-floating point arrays. It is just used as a sentinel that can be easily detected
![](Images/pd8.png)

In [31]:
## Filtering out missing data
data = Series([1, NA, 3.5, NA, 7])
print(data.dropna())
#or
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

0    1.0
2    3.5
4    7.0
dtype: float64

In [32]:
## Filling out missing data
df = DataFrame(np.random.randn(7, 3)) 
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df.fillna(value= 0, inplace= True)
df

          0         1         2
0 -0.715794  0.000000  0.000000
1  1.240891  0.000000  0.000000
2 -1.292110  0.000000 -0.886899
3  0.873839  0.000000  1.177171
4 -1.477165 -0.642213  0.471003
5  0.553948  0.018296  0.698071
6  1.390759  0.726923  0.252397

## Hierarchical Indexing
Hierarchical indexing is an important feature of pandas enabling you to have multiple (two or more) index levels on an axis. Somewhat abstractly, it provides a way for you to work with higher dimensional data in a lower dimensional form.

In [33]:
## Series
data = Series(np.random.randn(10),
                index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'], 
                       [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1   -0.445584
   2   -1.041384
   3   -0.174977
b  1   -1.394878
   2    0.698280
   3    0.004546
c  1    0.664528
   2    1.769747
d  2    0.837185
   3   -0.339895
dtype: float64

In [34]:
print(list(data.index))
data['b'] #selecting some part of series

[('a', 1), ('a', 2), ('a', 3), ('b', 1), ('b', 2), ('b', 3), ('c', 1), ('c', 2), ('d', 2), ('d', 3)]

1   -1.394878
2    0.698280
3    0.004546
dtype: float64

In [35]:
print(data['b': 'd'])
data[:, 2] #Selection from an “inner” level

b  1   -1.394878
   2    0.698280
   3    0.004546
c  1    0.664528
   2    1.769747
d  2    0.837185
   3   -0.339895
dtype: float64

a   -1.041384
b    0.698280
c    1.769747
d    0.837185
dtype: float64

In [36]:
## Dataframe
frame = DataFrame(np.arange(12).reshape((4, 3)),
                    index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]], columns=[['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']])
frame.index.name = ['k1', 'k2']
frame.columns.names = ['state', 'color']
print(frame)
frame['Ohio'] ## With partial column indexing you can similarly select groups of columns

state  Ohio     Colorado
color Green Red    Green
a 1       0   1        2
  2       3   4        5
b 1       6   7        8
  2       9  10       11

color  Green  Red
a 1        0    1
  2        3    4
b 1        6    7
  2        9   10

***Let's see how we can read .csv/.xlsx files and convert them into pandas dataframes***
## Data Loading and Storage using pandas
![](Images/pd9.png)

In [37]:
# reading .csv file
df = pd.read_csv('data/data.csv')
df.head(4) ## display first 4 rows of our dataframe

/Users/vasudevgupta/opt/anaconda3/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3058: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN

![](Images/pd10.png)

In [38]:
## getting columns of dataframe
df.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [39]:
## Reading Microsoft Excel Files
xls_file = pd.ExcelFile('data/data1.xlsx')
df = xls_file.parse('Sheet 1 - data') ## putting sheet name
df.head(4)

,data,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12
0,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
1,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595,567595,2011,NaN,San Francisco,NaN
2,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,NaN,538909,538909,2011,NaN,San Francisco,NaN
3,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,NaN,335280,335280,2011,NaN,San Francisco,NaN

In [40]:
# Saving df dataframe to disk
df.to_csv('data/convt_data.csv')

## Data Wrangling: Clean, Transform, Merge, Reshape using pandas

### Combining and Merging Data Sets
Data contained in pandas objects can be combined together in a number of built-in ways:
<ol>
<li>'pandas.merge' connects rows in DataFrames based on one or more keys. This will be familiar to users of SQL or other relational databases, as it implements database join operations.</li>
    <li>'pandas.concat' glues or stacks together objects along an axis.</li>
<li>'combine_first' instance method enables splicing together overlapping data to fill in missing values in one object with values from another.</li></ol>

In [41]:
## Merging datasets
df1 = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})
df2 = DataFrame({'key': ['a', 'b', 'd'], 'data2': range(3)})
pd.merge(df1, df2) # 'on' argument If not specified, merge uses the overlapping column names as the keys.

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

![](Images/pd11.png)

In [42]:
## Merging on index
left1 = DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'], 'value': range(6)})
right1 = DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])
print(pd.merge(left1, right1, left_on='key', right_index=True, how= 'outer'))

## or use .join method
left1.join(right1, on= 'key')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [43]:
## Concatenating Along an Axis
s1 = Series([0, 1], index=['a', 'b'])
s2 = Series([2, 3, 4], index=['c', 'd', 'e'])
s3 = Series([5, 6], index=['f', 'g'])
print(pd.concat([s1, s2, s3]))
           
df1 = DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'], columns=['one', 'two'])
df2 = DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'], columns=['three', 'four'])
pd.concat([df1, df2], axis= 1, sort= False)

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

   one  two  three  four
a    0    1    5.0   6.0
b    2    3    NaN   NaN
c    4    5    7.0   8.0

![](Images/pd12.png)
### Reshaping and Pivoting
Hierarchical indexing provides a consistent way to rearrange data in a DataFrame. There are two primary actions:
<ol><li>stack: this “rotates” or pivots from the columns in the data to the rows</li>
    <li>unstack: this pivots from the rows into the columns</li></ol>

In [44]:
data = DataFrame(np.arange(6).reshape((2, 3)),
index=pd.Index(['Ohio', 'Colorado'], name='state'), columns=pd.Index(['one', 'two', 'three'], name='number'))
print(data)
data.stack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

### Transforming Data Using a Function or Mapping

In [45]:
## map method
data = DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'pastrami', 'bacon', 'pastrami', 'honey ham','nova lox'],
                    'ounces': [4, 3, 12, 6, 7.5, 3, 5, 6]})
print(data)
meat_to_animal = { 'bacon': 'pig', 'pulled pork': 'pig', 'pastrami': 'cow', 'honey ham': 'pig', 'nova lox': 'salmon'}
data['animal'] = data['food'].map(meat_to_animal)
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4        bacon     7.5
5     pastrami     3.0
6    honey ham     5.0
7     nova lox     6.0

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4        bacon     7.5     pig
5     pastrami     3.0     cow
6    honey ham     5.0     pig
7     nova lox     6.0  salmon

In [46]:
## replace method
data = Series([1., -999., 2., -999., -1000., 3.])
data.replace({-999: np.nan, -1000: 0})
## or
data.replace([-999, -1000], 0)

0    1.0
1    0.0
2    2.0
3    0.0
4    0.0
5    3.0
dtype: float64

In [47]:
## Renaming Axis indexes
data = DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data.index = data.index.map(str.upper) ## capitalising indexes
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [48]:
## Descretization and Binning
#cut function
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins, right= False)
print(pd.value_counts(cats))

#qcut function
# bins the data based on sample quantiles and hence you will obtain roughly equal-size bins
data = np.random.randn(1000) # Normally distributed
cats = pd.qcut(data, 4) # Cut into quantiles
pd.value_counts(cats)

[25, 35)     4
[18, 25)     4
[35, 60)     3
[60, 100)    1
dtype: int64

(0.663, 3.35]                    250
(-0.00295, 0.663]                250
(-0.674, -0.00295]               250
(-3.0949999999999998, -0.674]    250
dtype: int64

In [49]:
## Computing Indicator/Dummy Variables
df = DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
print(df)
pd.get_dummies(df['key'])

# get_dummies with discretization
values = np.random.rand(10)
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           1           0           0           0
1           0           0           0           0           1
2           0           0           0           1           0
3           0           1           0           0           0
4           1           0           0           0           0
5           0           1           0           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           0           1

### GroupBy Mechanics
![](Images/pd14.png)
*Illustration of groupby aggregation*

In [50]:
df= DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],'key2' : ['one', 'two', 'one', 'two', 'one'], 
               'data1' : np.random.randn(5), 'data2' : np.random.randn(5)})
print(df)
grouped = df['data1'].groupby(df['key1'])
grouped

  key1 key2     data1     data2
0    a  one -0.712613 -0.463075
1    a  two -0.051723 -1.251915
2    b  one -0.085166  0.356829
3    b  two  0.750127  0.381737
4    a  one  0.889755 -0.666424

In [51]:
print(grouped.max())
grouped.max()

key1
a    0.889755
b    0.750127
Name: data1, dtype: float64

key1
a    0.889755
b    0.750127
Name: data1, dtype: float64

In [52]:
means = df['data1'].groupby([df['key1'], df['key2']]).sum()
print(means)
means.unstack()

key1  key2
a     one     0.177141
      two    -0.051723
b     one    -0.085166
      two     0.750127
Name: data1, dtype: float64

key2       one       two
key1
a     0.177141 -0.051723
b    -0.085166  0.750127

![](Images/pd15.png)

## Pivot Tables

In [53]:
dictn = {'total_bill': [120, 320, 120, 210, 320, 220], 'tip': [2,2,4,2,1,3], 
            'sex': ['f','m','f','f','m','f'], 'smoker': list('ynyynn'), 'time': list('dddddd'),
            'size':[2,4,2,1,1,5], 'tip_pct': [2,1,3,2,2,2]}
tips = pd.DataFrame(dictn, index= [109,183,232,67,178,87])
print(tips)

pd.pivot_table(tips, index= ['sex','smoker'])

     total_bill  tip sex smoker time  size  tip_pct
109         120    2   f      y    d     2        2
183         320    2   m      n    d     4        1
232         120    4   f      y    d     2        3
67          210    2   f      y    d     1        2
178         320    1   m      n    d     1        2
87          220    3   f      n    d     5        2

                size       tip   tip_pct  total_bill
sex smoker
f   n       5.000000  3.000000  2.000000         220
    y       1.666667  2.666667  2.333333         150
m   n       2.500000  1.500000  1.500000         320

Refer table below
![](Images/pd13.png)